app/Controllers/Teacher/Analytics.php

    public function index()
    {
        // Check authentication
        if (!$this->auth->loggedIn()) {
            return redirect()->to(base_url('login'));
        }

        $userId = $this->auth->id();
        $teacherModel = new TeacherModel();
        $studentModel = new StudentModel();
        $gradeModel = new GradeModel();
        $subjectModel = new SubjectModel();
        $sectionModel = new SectionModel();

        // Get the actual logged-in teacher
        $teacher = $teacherModel->where('user_id', $userId)->first();

        if (!$teacher) {
            return view('teacher/analytics', [
                'title' => 'Class Analytics - LPHS SMS',
                'error' => 'Teacher record not found'
            ]);
        }

        // Use current school year and quarter
        $schoolYear = '2025-2026';
        $currentQuarter = 1;

        // Get the section info for display
        $teacherSection = $sectionModel->where('adviser_id', $teacher['id'])->first();

        // Get students from sections where this teacher is adviser
        $myStudents = $studentModel->select('students.*, sections.section_name, sections.grade_level as section_grade')
            ->join('sections', 'sections.id = students.section_id', 'left')
            ->where('sections.adviser_id', $teacher['id'])
            ->where('students.enrollment_status', 'enrolled')
            ->findAll();
---
SELECT *
FROM `teachers`
WHERE `user_id` = 27
AND `teachers`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `sections`
WHERE `adviser_id` = '11'
AND `sections`.`deleted_at` IS NULL
 LIMIT 1
SELECT `students`.*, `sections`.`section_name`, `sections`.`grade_level` as `section_grade`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL

        $mySubjects = [];
        if (!empty($myStudents)) {
            $gradeLevels = array_unique(array_column($myStudents, 'grade_level'));
            $mySubjects = $subjectModel->whereIn('grade_level', $gradeLevels)
                ->where('is_active', true)
                ->findAll();
---
SELECT *
FROM `subjects`
WHERE `grade_level` IN ('7')
AND `is_active` = 1
AND `subjects`.`deleted_at` IS NULL


            foreach ($students as $student) {
                // Get grades for this specific student and subject
                $grade = $gradeModel->where('student_id', $student['id'])
                    ->where('subject_id', $subject['id'])
                    ->where('school_year', $schoolYear)
                    ->where('quarter', $currentQuarter)
                    ->first();
---
SELECT *
FROM `grades`
WHERE `student_id` = '5'
AND `subject_id` = '1'
AND `school_year` = '2025-2026'
AND `quarter` = 1
AND `grades`.`deleted_at` IS NULL
 LIMIT 1