app/Controllers/Teacher/Dashboard.php

SELECT *
FROM `teachers`
WHERE `user_id` = 27
AND `teachers`.`deleted_at` IS NULL
 LIMIT 1
---
    public function grades()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $teacherModel = new \App\Models\TeacherModel();
        $studentModel = new StudentModel();
        $subjectModel = new SubjectModel();
        $gradeModel = new GradeModel();

        // Get teacher record for logged-in user
        $teacher = $teacherModel->where('user_id', $teacherId)->first();