app/Controllers/Teacher/Dashboard.php

    public function index()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $gradeModel = new GradeModel();
        $studentModel = new StudentModel();
        $subjectModel = new SubjectModel();

        // Get teacher's basic info
        $teacherModel = new \App\Models\TeacherModel();
        $teacher = $teacherModel->where('user_id', $teacherId)->first();

        // Initialize default values
        $myStudents = [];
        $mySubjects = [];
        $recentGrades = [];
        $classAverages = [];
        $gradeDistribution = ['excellent' => 0, 'very_good' => 0, 'good' => 0, 'fair' => 0, 'failing' => 0];
        $quarterPerformance = [0, 0, 0, 0];

        if ($teacher) {
            // Get students from sections where this teacher is adviser
            $myStudents = $studentModel->select('students.id, students.first_name, students.last_name, students.grade_level, sections.section_name')
                ->join('sections', 'sections.id = students.section_id', 'left')
                ->where('sections.adviser_id', $teacher['id'])
                ->where('students.enrollment_status', 'enrolled')
                ->limit(10)
                ->findAll();
---
SELECT *
FROM `teachers`
WHERE `user_id` = 27
AND `teachers`.`deleted_at` IS NULL
 LIMIT 1
SELECT `students`.`id`, `students`.`first_name`, `students`.`last_name`, `students`.`grade_level`, `sections`.`section_name`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL
 LIMIT 10

    public function grades()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $teacherModel = new \App\Models\TeacherModel();
        $studentModel = new StudentModel();
        $subjectModel = new SubjectModel();
        $gradeModel = new GradeModel();

        // Force Demo Teacher for all users
        $teacher = $teacherModel->find(11); // Demo Teacher ID

        $students = [];
        $subjects = [];
        $studentGrades = [];
        $totalPages = 1;
        $currentPage = 1;

        if ($teacher) {
            // Get pagination parameters
            $currentPage = (int) ($this->request->getGet('page') ?? 1);
            $perPage = 15;
            $offset = ($currentPage - 1) * $perPage;

            // Get total count for pagination
            $totalStudents = $studentModel->select('students.id')
                ->join('sections', 'sections.id = students.section_id', 'left')
                ->where('sections.adviser_id', $teacher['id'])
                ->where('students.enrollment_status', 'enrolled')
                ->countAllResults();
---
SELECT *
FROM `teachers`
WHERE `teachers`.`deleted_at` IS NULL
AND `teachers`.`id` = 11
SELECT COUNT(*) AS `numrows`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL

            $totalPages = ceil($totalStudents / $perPage);

            // Get students from advised sections with pagination
            $students = $studentModel->select('students.id, students.lrn, students.first_name, students.last_name, students.grade_level, sections.section_name')
                ->join('sections', 'sections.id = students.section_id', 'left')
                ->where('sections.adviser_id', $teacher['id'])
                ->where('students.enrollment_status', 'enrolled')
                ->orderBy('students.last_name', 'ASC')
                ->limit($perPage, $offset)
                ->findAll();
---
SELECT `students`.`id`, `students`.`lrn`, `students`.`first_name`, `students`.`last_name`, `students`.`grade_level`, `sections`.`section_name`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL
ORDER BY `students`.`last_name` ASC
 LIMIT 15

            // Get subjects for the grade levels of advised students
            if (!empty($students)) {
                $gradeLevels = array_unique(array_column($students, 'grade_level'));
                $subjects = $subjectModel->whereIn('grade_level', $gradeLevels)
                    ->orderBy('grade_level', 'ASC')
                    ->orderBy('subject_name', 'ASC')
                    ->findAll();
---
SELECT *
FROM `subjects`
WHERE `grade_level` IN ('7')
AND `subjects`.`deleted_at` IS NULL
ORDER BY `grade_level` ASC, `subject_name` ASC

                $currentQuarter = $this->getCurrentQuarter();
                foreach ($students as $student) {
                    foreach ($subjects as $subject) {
                        $grade = $gradeModel->where('student_id', $student['id'])
                            ->where('subject_id', $subject['id'])
                            ->where('teacher_id', $teacher['id'])
                            ->where('quarter', $currentQuarter)
                            ->where('school_year', '2024-2025')
                            ->first();
---
SELECT *
FROM `grades`
WHERE `student_id` = '25'
AND `subject_id` = '5'
AND `teacher_id` = '11'
AND `quarter` = 1
AND `school_year` = '2025-2026'
AND `grades`.`deleted_at` IS NULL
 LIMIT 1

    public function students()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $teacherModel = new \App\Models\TeacherModel();
        $studentModel = new StudentModel();

        // Force Demo Teacher for all users
        $teacher = $teacherModel->find(11); // Demo Teacher ID
        log_message('info', 'Force using Demo Teacher ID 11 for all users');

        $students = [];

        if ($teacher) {
            log_message('info', 'Teacher ID: ' . $teacher['id'] . ', User ID: ' . $teacherId);

            // Get students from sections where this teacher is adviser
            $students = $studentModel->select('students.*, sections.section_name')
                ->join('sections', 'sections.id = students.section_id', 'left')
                ->where('sections.adviser_id', $teacher['id'])
                ->where('students.enrollment_status', 'enrolled')
                ->orderBy('students.last_name', 'ASC')
                ->findAll();
---
SELECT *
FROM `teachers`
WHERE `teachers`.`deleted_at` IS NULL
AND `teachers`.`id` = 11
SELECT `students`.*, `sections`.`section_name`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL
ORDER BY `students`.`last_name` ASC

    public function schedule()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $teacherModel = new \App\Models\TeacherModel();
        $scheduleModel = new \App\Models\TeacherScheduleModel();

        // Get teacher record
        $teacher = $teacherModel->where('user_id', $teacherId)->first();
---
SELECT *
FROM `teachers`
WHERE `user_id` = 27
AND `teachers`.`deleted_at` IS NULL
 LIMIT 1

    public function attendance()
    {
        if (!$this->auth->user()->inGroup('teacher')) {
            return redirect()->to(base_url('/'));
        }

        $teacherId = $this->auth->id();
        $teacherModel = new \App\Models\TeacherModel();
        $studentModel = new StudentModel();
        $attendanceModel = new AttendanceModel();

        // Force Demo Teacher for all users
        $teacher = $teacherModel->find(11); // Demo Teacher ID
        $students = [];
        $attendanceData = [];
        $selectedDate = $this->request->getGet('date') ?? date('Y-m-d');

        if ($teacher) {
            // Get students from advised sections
            $students = $studentModel->select('students.id, students.lrn, students.first_name, students.last_name, students.grade_level, sections.section_name')
                ->join('sections', 'sections.id = students.section_id', 'left')
                ->where('sections.adviser_id', $teacher['id'])
                ->where('students.enrollment_status', 'enrolled')
                ->orderBy('students.last_name', 'ASC')
                ->findAll();
---
SELECT *
FROM `teachers`
WHERE `teachers`.`deleted_at` IS NULL
AND `teachers`.`id` = 11
SELECT `students`.`id`, `students`.`lrn`, `students`.`first_name`, `students`.`last_name`, `students`.`grade_level`, `sections`.`section_name`
FROM `students`
LEFT JOIN `sections` ON `sections`.`id` = `students`.`section_id`
WHERE `sections`.`adviser_id` = '11'
AND `students`.`enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL
ORDER BY `students`.`last_name` ASC