app/Filters/StudentAccessFilter.php

SELECT *
FROM `students`
WHERE `user_id` = 53
AND `students`.`deleted_at` IS NULL
 LIMIT 1
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $auth = service('auth');

        // Check if user is logged in
        if (!$auth->loggedIn()) {
            return redirect()->to(base_url('login'));
        }

        $user = $auth->user();

        // Check if user is a student
        if (!$user->inGroup('student')) {
            return redirect()->to(base_url('login'))->with('error', 'Access denied.');
        }

        // Check student enrollment status
        try {
            $studentModel = new \App\Models\StudentModel();
            $student = $studentModel->where('user_id', $user->id)->first();