app/Controllers/Student/Dashboard.php

SELECT *
FROM `announcements`
WHERE `target_roles` = 'all'
OR `target_roles` = 'student'
AND `announcements`.`deleted_at` IS NULL
ORDER BY `published_at` DESC
 LIMIT 3
SELECT *
FROM `notifications`
WHERE `user_id` = 53
AND `notifications`.`deleted_at` IS NULL
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = 53
AND `is_read` = 0
AND `notifications`.`deleted_at` IS NULL
---
    public function index()
    {
        // TEMPORARY: Bypass authentication to test if the issue is with auth or the view
        try {
            // Try to get auth status without redirecting
            $isLoggedIn = $this->auth->loggedIn();
            $authStatus = $isLoggedIn ? 'Logged in' : 'Not logged in';
        } catch (\Throwable $e) {
            $authStatus = 'Auth error: ' . $e->getMessage();
        }

        // Get recent announcements
        $announcementModel = new AnnouncementModel();
        $announcements = $announcementModel->where('target_roles', 'all')
            ->orWhere('target_roles', 'student')
            ->orderBy('published_at', 'DESC')
            ->limit(3)
            ->findAll();

        // Get recent notifications for current user
        $notificationModel = new NotificationModel();
        $notifications = $notificationModel->where('user_id', $this->auth->id() ?? 1)
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->findAll();

        $unreadCount = $notificationModel->where('user_id', $this->auth->id() ?? 1)
            ->where('is_read', false)
            ->countAllResults();

SELECT *
FROM `students`
WHERE `user_id` = 53
AND `students`.`deleted_at` IS NULL
 LIMIT 1
---
                $studentModel = new \App\Models\StudentModel();
                $gradeModel = new \App\Models\GradeModel();

                $student = $studentModel->where('user_id', $this->auth->id())->first();