app/Controllers/Auth.php

    public function demo(string $role)
    {
        $role = strtolower($role);

        // Demo credentials mapping - use existing accounts
        $demoCredentials = [
            'admin' => ['email' => 'admin@lphs.edu', 'password' => 'admin123'],
            'teacher' => ['email' => 'demo.teacher@lphs.edu', 'password' => 'DemoPass123!'],
            'student' => ['email' => 'student@lphs.edu', 'password' => 'student123'],
        ];

        if (!isset($demoCredentials[$role])) {
            return redirect()->to(base_url('login'))->with('error', 'Unknown demo role.');
        }

        $creds = $demoCredentials[$role];

        // Use email for all demo accounts as fallback
        $identifier = $creds['email'];

        // Find user by identifier and login directly
        $teacherModel = model('TeacherModel');
        $studentModel = model('StudentModel');
        $userModel = model(UserModel::class);

        $user = null;

        // Find user by email for all demo accounts
        $user = $userModel->where('email', $identifier)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'student@lphs.edu'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    private function getDashboardUrl(): string
    {
        // Check if user is logged in before accessing user data
        if (!$this->auth->loggedIn()) {
            return base_url('login');
        }

        try {
            $user = $this->auth->user();

            if ($user->inGroup('admin')) {
                return base_url('admin/dashboard');
            } elseif ($user->inGroup('teacher')) {
                return base_url('teacher/dashboard');
            } elseif ($user->inGroup('student')) {
                // Check if student is approved before allowing access
                $studentModel = new \App\Models\StudentModel();
                $student = $studentModel->where('user_id', $user->id)->first();
---
SELECT *
FROM `students`
WHERE `user_id` = 53
AND `students`.`deleted_at` IS NULL
 LIMIT 1