app/Controllers/Home.php

SELECT *
FROM `announcements`
WHERE `announcements`.`deleted_at` IS NULL
ORDER BY `published_at` DESC
 LIMIT 5
---
    public function index(): ResponseInterface|string
    {
        // If logged in, send user to their role dashboard instead of landing page
        try {
            $auth = auth();
            if ($auth->loggedIn()) {
                $user = $auth->user();
                if ($user->inGroup('admin')) {
                    return redirect()->to(base_url('admin/dashboard'));
                }
                if ($user->inGroup('teacher')) {
                    return redirect()->to(base_url('teacher/dashboard'));
                }
                if ($user->inGroup('student')) {
                    return redirect()->to(base_url('student/dashboard'));
                }
                if ($user->inGroup('parent')) {
                    return redirect()->to(base_url('parent/dashboard'));
                }
            }
        } catch (\Throwable $e) {
            // ignore and show public landing page
        }

        $announcements = [];
        $enrollmentData = [];
        $predictionData = [];

        try {
            $model = new AnnouncementModel();
            $announcements = $model->orderBy('published_at', 'DESC')->findAll(5);

SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `enrollment_status` = 'enrolled'
AND `students`.`deleted_at` IS NULL
---
    private function getEnrollmentData(): array
    {
        $studentModel = new StudentModel();

        try {
            // Get total enrolled students
            $totalStudents = $studentModel->where('enrollment_status', 'enrolled')->countAllResults();