app/Models/AttendanceModel.php

    public function getAttendanceByDate($teacherId, $date)
    {
        return $this->select('attendance.*, students.first_name, students.last_name, students.lrn')
                    ->join('students', 'students.id = attendance.student_id')
                    ->where('attendance.teacher_id', $teacherId)
                    ->where('attendance.date', $date)
                    ->findAll();
---
SELECT `attendance`.*, `students`.`first_name`, `students`.`last_name`, `students`.`lrn`
FROM `attendance`
JOIN `students` ON `students`.`id` = `attendance`.`student_id`
WHERE `attendance`.`teacher_id` = '11'
AND `attendance`.`date` = '2025-10-12'