app/Models/GradeModel.php

SELECT `grades`.`grade`, `subjects`.`units`
FROM `grades`
JOIN `subjects` ON `subjects`.`id` = `grades`.`subject_id`
WHERE `grades`.`student_id` = '157'
AND `grades`.`school_year` = '2024-2025'
AND `grades`.`quarter` = 2
AND `grades`.`grade` IS NOT NULL
AND `grades`.`deleted_at` IS NULL
---
    public function getQuarterAverage($studentId, $schoolYear, $quarter)
    {
        $grades = $this->select('grades.grade, subjects.units')
            ->join('subjects', 'subjects.id = grades.subject_id')
            ->where('grades.student_id', $studentId)
            ->where('grades.school_year', $schoolYear)
            ->where('grades.quarter', $quarter)
            ->where('grades.grade IS NOT NULL')
            ->findAll();