app/Models/SystemSettingModel.php

SELECT *
FROM `system_settings`
WHERE `setting_key` = 'current_quarter'
 LIMIT 1
---
    public function getSetting($key, $default = null)
    {
        $setting = $this->where('setting_key', $key)->first();