app/Models/TeacherScheduleModel.php

    public function getTeacherSchedule($teacherId, $schoolYear = '2025-2026')
    {
        return $this->select('teacher_schedules.*, subjects.subject_name, subjects.subject_code, sections.section_name, sections.grade_level')
            ->join('subjects', 'subjects.id = teacher_schedules.subject_id')
            ->join('sections', 'sections.id = teacher_schedules.section_id')
            ->where('teacher_schedules.teacher_id', $teacherId)
            ->where('teacher_schedules.school_year', $schoolYear)
            ->orderBy('teacher_schedules.day_of_week')
            ->orderBy('teacher_schedules.start_time')
            ->findAll();
---
SELECT `teacher_schedules`.*, `subjects`.`subject_name`, `subjects`.`subject_code`, `sections`.`section_name`, `sections`.`grade_level`
FROM `teacher_schedules`
JOIN `subjects` ON `subjects`.`id` = `teacher_schedules`.`subject_id`
JOIN `sections` ON `sections`.`id` = `teacher_schedules`.`section_id`
WHERE `teacher_schedules`.`teacher_id` = '11'
AND `teacher_schedules`.`school_year` = '2024-2025'
ORDER BY `teacher_schedules`.`day_of_week`, `teacher_schedules`.`start_time`